Tekla Open API Reference for Tekla Structures 2025
ShapeCatalog Class
 The ShapeCatalog class represents a group of controls to select Shapes using the Shape catalog.
Inheritance Hierarchy
System.Object
 System.MarshalByRefObject
 System.ComponentModel.Component
 System.Windows.Forms.Control
 System.Windows.Forms.ScrollableControl
 System.Windows.Forms.ContainerControl
 System.Windows.Forms.UserControl
 Tekla.Structures.Dialog.UIControls.ShapeCatalog
 Namespace: Tekla.Structures.Dialog.UIControls
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public class ShapeCatalog : UserControl
Public Class ShapeCatalog
	Inherits UserControl
The ShapeCatalog type exposes the following members.
Constructors
Name | Description
ShapeCatalog()
 Initializes a new instance of the ShapeCatalog class.
ShapeCatalog(String)
 Initializes a new instance of the ShapeCatalog class and will select the Shape (if available) in the tree.
Top
Properties
Name | Description
ButtonText
 Gets and sets the text of the button control.
SelectedShape
 Gets or sets the selected Shape in the control.
Top
Methods
Name | Description
OnValueChanged
 Event handler for passing generic catalog data back to dialog
Top
Events
Name | Description
SelectClicked
 The SelectClicked event is raised when the Select button is clicked.
SelectionDone
 The SelectionDone event is raised when the selection has been done.
Top
See Also
Reference
Tekla.Structures.Dialog.UIControls Namespace